# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOv2, ['l', True, True]] # 0 P1 1/14

# YOLOv8.0n head
head:
  # [from, number, module, args]
  - [0, 1, nn.Upsample, [None, 2, "nearest"]] # P1 1/7
  - [-1, 2, C3k2, [256, True]] # 2 0.75M

  - [0, 1, nn.Identity, []] # P2 1/14
  - [-1, 2, C3k2, [512, True]] # 4 2.50M

  - [0, 1, Conv, [1024, 3, 2]]  # P3 1/28 9.44M
  - [-1, 2, C3k2, [1024, True]] # 6 8.93M

  - [[2, 4, 6], 1, Detect, [nc]] # Detect(P3, P4, P5) 1.90M on COCO
  
  # total: 23.52M