# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOv2, ['l', False, True]]

# YOLO11n head
head:
  # [from, number, module, args]
  - [[-1], 1, Detect, [nc]]
